#### Terraform working directory 🏠: `demo/demo-account/network/security-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security-group.module.sgs["test-galvin-01"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "test-galvin-01"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-galvin-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-galvin-01"
        }
      + tags_all               = {
          + "Name" = "test-galvin-01"
        }
      + vpc_id                 = "vpc-0d06ae2c66a271e42"
    }

  # module.security-group.module.sg_rules["test-galvin-01"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @Galvin-wjw
**Action**: pull_request
